# PowerFactorState Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..PowerFactorState Property
ElectricalSystem Class See Also
---
The PowerFactorState type of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public PowerFactorStateType PowerFactorState { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PowerFactorState As PowerFactorStateType
	Get
```

Visual C++
---
```text
public:
property PowerFactorStateType PowerFactorState {
	PowerFactorStateType get ();
}
```

# Remarks
This property is used to retrieve the PowerFactorState type of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This property only available when System Type is Power! |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace